# LightingFixtureLumensWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..IlluminationFailures..::..LightingFixtureLumensWarning Property
BuiltInFailures..::..IlluminationFailures Class See Also
---
Estimated Illumination failed. Lumens not set for lighting fixture.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LightingFixtureLumensWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LightingFixtureLumensWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LightingFixtureLumensWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..IlluminationFailures Class
Autodesk.Revit.DB Namespace